In [1]:
import pandas as pd

In [2]:
india_weather=pd.DataFrame({
    "city":["mumbai", "delhi", "banglore"],
    "temperature":[45,43,54],
    "humidity":[80,60,78]
})

In [3]:
india_weather

       city  temperature  humidity
0    mumbai           45        80
1     delhi           43        60
2  banglore           54        78

In [4]:
us_weather=pd.DataFrame({
    "city":["boston", "new_york", "new orleans"],
    "temperature":[33,25,38],
    "humidity":[70,40,38]
})
us_weather

          city  temperature  humidity
0       boston           33        70
1     new_york           25        40
2  new orleans           38        38

## CONCAT

In [9]:
## Merge to dataframes
df=pd.concat([india_weather, us_weather])
df

          city  temperature  humidity
0       mumbai           45        80
1        delhi           43        60
2     banglore           54        78
0       boston           33        70
1     new_york           25        40
2  new orleans           38        38

In [8]:
## to remove the index
df=pd.concat([india_weather, us_weather], ignore_index=True)
df

          city  temperature  humidity
0       mumbai           45        80
1        delhi           43        60
2     banglore           54        78
3       boston           33        70
4     new_york           25        40
5  new orleans           38        38

In [10]:
## Kinda create a subcategory
df=pd.concat([india_weather, us_weather], keys=["india", "usa"])
df

                city  temperature  humidity
india 0       mumbai           45        80
      1        delhi           43        60
      2     banglore           54        78
usa   0       boston           33        70
      1     new_york           25        40
      2  new orleans           38        38

In [14]:
## Select a specific key for india and usa
df.loc["india"]

       city  temperature  humidity
0    mumbai           45        80
1     delhi           43        60
2  banglore           54        78

In [13]:
df.loc["usa"]

          city  temperature  humidity
0       boston           33        70
1     new_york           25        40
2  new orleans           38        38

In [17]:
temperature_df=pd.DataFrame({
    "city":["mumbai", "delhi", "banglore"],
    "temperature":[33,25,38]})
temperature_df

       city  temperature
0    mumbai           33
1     delhi           25
2  banglore           38

In [18]:
windspeed_df=pd.DataFrame({
    "city":["mumbai", "delhi", "banglore"],
    "windspeed":[7,12,3]})
windspeed_df

       city  windspeed
0    mumbai          7
1     delhi         12
2  banglore          3

In [20]:
## Concat with having a third column
pd.concat([temperature_df, windspeed_df])
## That does not look right

       city  temperature  windspeed
0    mumbai         33.0        NaN
1     delhi         25.0        NaN
2  banglore         38.0        NaN
0    mumbai          NaN        7.0
1     delhi          NaN       12.0
2  banglore          NaN        3.0

In [22]:
df=pd.concat([temperature_df, windspeed_df], axis=1)
df

       city  temperature      city  windspeed
0    mumbai           33    mumbai          7
1     delhi           25     delhi         12
2  banglore           38  banglore          3

In [31]:
## What if the order of cities is different
windspeed_df=pd.DataFrame({
    "city":["delhi", "mumbai"],
    "windspeed":[7,12]}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [30]:
temperature_df=pd.DataFrame({
    "city":["mumbai", "delhi", "banglore"],
    "temperature":[33,25,38]},
index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           33
1     delhi           25
2  banglore           38

In [33]:
pd.concat([temperature_df, windspeed_df], axis=1)

       city  temperature    city  windspeed
0    mumbai           33  mumbai       12.0
1     delhi           25   delhi        7.0
2  banglore           38     NaN        NaN

In [35]:
s=pd.Series(["Humid", "Dry", "Rain"],name="event" )
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [37]:
pd.concat([temperature_df, s], axis=1)

       city  temperature  event
0    mumbai           33  Humid
1     delhi           25    Dry
2  banglore           38   Rain